/*************************************************************************************************
 * @file		playerTask.h
 *
 * @brief		Заголовок модуля главного проигрывателя
 *
 * @version		v1.0
 * @date		10.09.2013
 * @author		Mike Smith
 *
 ************************************************************************************************/
#ifndef PLAYERTASK_H_
#define PLAYERTASK_H_

//*-----------------------------------------------------------------------------------------------
//*			Типы
//*-----------------------------------------------------------------------------------------------
/// команды управления проигрывателем
typedef enum
{
	CMD_NONE,
	CMD_INIT,
	CMD_DEINIT,
	CMD_START,		// начать воспроизведение
	CMD_STOP,		// остановить воспроизведение
	CMD_PAUSE,		// сделать паузу
	CMD_NEXT,		// следующий трек
//	CMD_CONTINUE,	// продолжить

	CMD_VOLUME_UP,
	CMD_VOLUME_DOWN,
	CMD_PAUSE_RESUME,

	SONG_COMPLETE,	// текущий трек проигран полностью
	DECODE_ERROR,	// ошибка декодирования текущего трека
} cmd_t;


/// состояние плейера
typedef enum
{
	NO_INIT,
	PLAYING,
	STOPPED,
	PAUSED,
} player_state_t;


/// начальные параметры для декодера
typedef struct
{
	FIL * file;					// текущий файл
	//OS_FlagID	playCmdMailBox;	// mailbox для управления главным проигрывателем
	//dac_cmd_i *	DAC_interface;	// интерфейс управления ЦАП
} decoder_param_t;


//*-----------------------------------------------------------------------------------------------
//*			Переменные
//*-----------------------------------------------------------------------------------------------
//extern player_state_t playerState;
//extern OS_FlagID  dac_DataReqFlag;


//*-----------------------------------------------------------------------------------------------
//*			Функции модуля
//*-----------------------------------------------------------------------------------------------
//OS_EventID playerCtrlInit(dac_cmd_i * pDAC);


#endif /* PLAYERTASK_H_ */
